In [14]:
import pandas as pd

Pandas has two basic data types

Series are one dimensional column of data

DataFrame is two domensional data with rows and column

In [15]:
# Lets take an example of cars
cars = pd.Series(["Bwm","Honda","Suzuki"])
colours = pd.Series(["Red","blue","Green"])
cars+colours

0         BwmRed
1      Hondablue
2    SuzukiGreen
dtype: object

In [16]:
car_data = pd.DataFrame({"Car Model": cars,
                         "car Colour": colours})

In [17]:
car_data

  Car Model car Colour
0       Bwm        Red
1     Honda       blue
2    Suzuki      Green

In [28]:
import pandas as pd

food = pd.Series (["eggs","Apple","Banana"])
price = pd.Series([25,120,5])

Grousery = pd.DataFrame({"Food name": food,
                        "Food price": price})

Grousery

  Food name  Food price
0      eggs          25
1     Apple         120
2    Banana           5

In [29]:
car_details = pd.read_csv("CarSales.csv")

In [30]:
car_details

     Make Colour  Odometer  Doors     Price  Unnamed: 5
0  Toyota  White    150043      4   $4,000          NaN
1   Honda    Red     87899      4   $5,000          NaN
2  Toyota   Blue     32549      3   $7,000          NaN
3     BMW  Black     11179      5  $22,000          NaN
4  Nissan  White    213095      4   $3,500          NaN
5  Toyota  Green     99213      4   $4,500          NaN
6   Honda   Blue     45698      4   $7,500          NaN
7   Honda   Blue     54738      4   $7,000          NaN
8  Toyota  White     60000      4   $6,250          NaN
9  Nissan  White     31600      4   $9,700          NaN

In [33]:
car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Make        10 non-null     object
 1   Colour      10 non-null     object
 2   Odometer    10 non-null     int64
 3   Doors       10 non-null     int64
 4   Price       10 non-null     object
 5   Unnamed: 5  0 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 608.0+ bytes

In [35]:
sam = car_details.describe()

In [43]:
sam.columns

Index(['Odometer', 'Doors', 'Unnamed: 5'], dtype='object')

In [52]:
x.index

AttributeError: 'Index' object has no attribute 'index'

In [53]:
car_details.index

RangeIndex(start=0, stop=10, step=1)

In [55]:
heart_data = pd.read_csv("../heart-disease.csv")

In [56]:
heart_data

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [57]:
heart_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [59]:
heart_data.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [72]:
heart_data['target'][:5]

0    1
1    1
2    1
3    1
4    1
Name: target, dtype: int64

In [75]:
pd.crosstab(car_details["Make"],car_details["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [111]:
x =car_details["Price"].replace('\D', '', regex=True).astype(int)

In [112]:
x,car_details

(0     4000
 1     5000
 2     7000
 3    22000
 4     3500
 5     4500
 6     7500
 7     7000
 8     6250
 9     9700
 Name: Price, dtype: int32,
      Make Colour  Odometer  Doors     Price  Unnamed: 5
 0  Toyota  White    150043      4   $4,000          NaN
 1   Honda    Red     87899      4   $5,000          NaN
 2  Toyota   Blue     32549      3   $7,000          NaN
 3     BMW  Black     11179      5  $22,000          NaN
 4  Nissan  White    213095      4   $3,500          NaN
 5  Toyota  Green     99213      4   $4,500          NaN
 6   Honda   Blue     45698      4   $7,500          NaN
 7   Honda   Blue     54738      4   $7,000          NaN
 8  Toyota  White     60000      4   $6,250          NaN
 9  Nissan  White     31600      4   $9,700          NaN)